# -*- coding: utf-8 -*-
"""
Created on Fri Jan  3 13:46:18 2025

@author: user
"""

Speed = int(input("請輸入風速等級："))
# =============================================================================
# if Speed >= 16:
#     print("強烈颱風")
# elif Speed >= 12:
#     print("中度颱風")
# elif Speed >= 8:
#     print("輕度颱風")
# else:
#     print("未達輕度颱風等級")
# =============================================================================

# =============================================================================
# # 錯誤寫法
# if Speed >= 8:
#     print("輕度颱風")
# elif Speed >= 12:
#     print("中度颱風")
# elif Speed >= 16:
#     print("強烈颱風")
# else:
#     print("未達輕度颱風等級")
# =============================================================================

if Speed < 8:
    print("未達輕度颱風等級")
elif Speed < 12:
    print("輕度颱風")
elif Speed < 16:
    print("中度颱風")
else:
    print("強烈颱風")