# -*- coding: utf-8 -*-
import pandas as pd

df = pd.read_excel("0050.xlsx")
ori_df = df.copy()
# 買賣價格
df["隔日開盤價"] = df["開盤價"].shift(-1)
df["賣出收盤價"] = df["收盤價"].shift(-5)
# 刪除沒有買賣價格的資料
df = df.dropna(subset = ["隔日開盤價", "賣出收盤價"])

# 如果用這個月的平均值，在這個月交易，不合理
# 1/4的時間點就可以看到1月整個月的平均值，實務上做不到
# 前視錯誤，偷看答案
df_mean = df["收盤價"].mean()
# 篩選符合進場條件的資料
df = df[ df["收盤價"] < df_mean ]
# 交易成本分成手續費與證交稅
# 台灣交易手續費：0.001425，最低20元，券商可以打折，假設打五折
# 證交稅：0.003
# 手續費在買賣都要付，交易稅只有在賣出時需要付
# 計算時，交易成本視為成本的加項，收入的減項
df["隔日開盤價"] *= (1 + 0.001425 * 0.5)
df["賣出收盤價"] *= (1 - 0.001425 * 0.5 - 0.003)

# 計算買賣獲利
df["損益"] = (df["賣出收盤價"] - df["隔日開盤價"]) * 1000
print("總損益", df["損益"].sum())
print("平均損益", df["損益"].mean())
print("交易次數",df["損益"].count())
